package KostiantynViunichenko.test3;

// создать колледж, университет и школы с помощью перечисления.
// Вывести их в последовательности обучения используя метод ordinals
//
//
//public class EducationCenter {
//    public static void main(String[] args) {
//        EducationCenter arr[] = EducationCenter.values();
//        System.out.println("Plan");
//
//        for (EducationCenter item: arr) {
//            System.out.println((item.ordinal()+1)+" "+ item);
//
//        }
//    }
//}
